app/Controllers/ArchivoController.php

SELECT `archivos`.*, `clasificaciones`.`nombre` AS `clasificacion_nombre`
FROM `archivos`
JOIN `clasificaciones` ON `clasificaciones`.`id` = `archivos`.`clasificacion_id`
WHERE `archivos`.`deleted_at` IS NULL
ORDER BY `archivos`.`id` DESC
---
    public function index()
    {
        $archivoModel = new ArchivoModel();
        $data['archivos'] = $archivoModel->select('archivos.*, clasificaciones.nombre AS clasificacion_nombre')
            ->join('clasificaciones', 'clasificaciones.id = archivos.clasificacion_id')
            ->orderBy('archivos.id', 'desc')
            ->findAll();

SELECT *
FROM `clasificaciones`
WHERE `clasificaciones`.`deleted_at` IS NULL
---
    public function create()
    {
        $clasificacionModel = new ClasificacionModel();
        $data['clasificaciones'] = $clasificacionModel->findAll();

INSERT INTO `archivos` (`nombre`, `ruta`, `clasificacion_id`, `peso`, `tipo`, `created_at`, `updated_at`) VALUES ('CVU Edgar Degante Aguilar_4.pdf', 'uploads/recursosDigitales/CVU Edgar Degante Aguilar_4.pdf', '1', 1040660, 'application/pdf', '2024-09-13 14:52:05', '2024-09-13 14:52:05')
---
                        'tipo' => $file->getClientMimeType(),
                    ];

                    $archivoModel->insert($data);

SELECT *
FROM `archivos`
WHERE `archivos`.`deleted_at` IS NULL
AND `archivos`.`id` = '42'
---
    public function visualizar($id)
    {
        $archivoModel = new ArchivoModel();
        $archivo = $archivoModel->find($id);

SELECT *
FROM `archivos`
WHERE `archivos`.`deleted_at` IS NULL
AND `archivos`.`id` = '11'
---
    public function visualizar2($id)
    {
        $archivoModel = new ArchivoModel();
        $archivo = $archivoModel->find($id);