app/Controllers/Home.php

    public function index()
    {
        $model = new CarouselModel();
        $data['images'] = $model->where('estado', 'activo')->where('tipo', 'imagen')->findAll();
        $data['gestorbibliografico'] = $model->where('estado', 'activo')->where('tipo', 'gestorbibliografico')->findAll();
        $data['buscadoracademico'] = $model->where('estado', 'activo')->where('tipo', 'buscadoracademico')->findAll();
        $data['traductor'] = $model->where('estado', 'activo')->where('tipo', 'traductor')->findAll();
        $data['tppsicometricas'] = $model->where('estado', 'activo')->where('tipo', 'tppsicometricas')->findAll();
        $data['diccionario'] = $model->where('estado', 'activo')->where('tipo', 'diccionario')->findAll();
        $data['enciclopedia'] = $model->where('estado', 'activo')->where('tipo', 'enciclopedia')->findAll();
        $data['prelectronicos'] = $model->where('estado', 'activo')->where('tipo', 'prelectronicos')->findAll();
---
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'imagen'
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'gestorbibliografico'
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'buscadoracademico'
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'traductor'
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'tppsicometricas'
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'diccionario'
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'enciclopedia'
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'prelectronicos'