app/Controllers/Recursos.php

    public function index()
    {
        $data['recursos'] = $this->recursoModel
            ->select('recursos.*, generos.nombre as genero_nombre, editoriales.nombre as editorial_nombre')
            ->join('generos', 'generos.id = recursos.genero')
            ->join('editoriales', 'editoriales.id = recursos.editorial')
            ->findAll();
---
SELECT `recursos`.*, `generos`.`nombre` as `genero_nombre`, `editoriales`.`nombre` as `editorial_nombre`
FROM `recursos`
JOIN `generos` ON `generos`.`id` = `recursos`.`genero`
JOIN `editoriales` ON `editoriales`.`id` = `recursos`.`editorial`
WHERE `recursos`.`deleted_at` IS NULL
ORDER BY `recursos`.`id` DESC

            'tipo' => $tipo
        ]);

        $recurso_id = $this->recursoModel->insertID();
---
INSERT INTO `recursos` (`titulo`, `isbn`, `genero`, `editorial`, `tag`, `anio_publicacion`, `idioma`, `edicion`, `portada`, `paginas`, `fecha_publicacion`, `clasificacion`, `formato`, `precio`, `sellado`, `etiquetado`, `archivo`, `descripcion`, `temas`, `notas`, `tipo`, `created_at`, `updated_at`) VALUES ('FUNDAMENTOS DE PHP', '978-0-07-154901-1', '2', '1', '1', '2009', '', '', '', '', '', '', '', '', NULL, NULL, '', '', '', '', '', '2024-11-03 20:26:17', '2024-11-03 20:26:17')