app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data['users'] = $this->model->findAll();