app/Models/RecursoModel.php

SELECT *
FROM `autores`
JOIN `autores_recursos` ON `autores`.`id` = `autores_recursos`.`autor`
WHERE `autores_recursos`.`recurso` = '9'
---
    public function getAutoresByRecursoId($recursoId)
    {
        return $this->db->table('autores')
            ->join('autores_recursos', 'autores.id = autores_recursos.autor')
            ->where('autores_recursos.recurso', $recursoId)
            ->get()
            ->getResultArray();